[
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 14, "company": "Apple", "jobkey": "f6aa22949d74b7dc", "jobTitle": "Engineering Program Manager (Hanoi)", "jobDescription": "<div>\n <div>\n  <div>\n   <div>\n    <h2 class=\"jobSectionHeader\"><b>Summary</b></h2> \n    <div>\n     <div>\n      Posted: Jun 19, 2023\n     </div> \n     <div>\n      <div>\n       Role Number:\n       <b>200363825</b>\n      </div> \n     </div>\n     <div>\n      Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The In-Region Engineering Program Management (EPM) group is a growing, high energy, results oriented team. The Engineering Program Engineer/Manager role at Apple is both challenging and demanding. This role works with both in-region and US based Engineering Project Managers, Hardware Engineering, Product Design, Software teams and CM partners to handle risks associated with Engineering Development builds. As an Engineering Program Engineer/Manager in the New Technology organisation, you will be responsible for leading the development builds of key modules (Display, Camera, Touch ID, etc.). Your goals are to ensure that modules are built according to specifications, and given timeline.\n     </div> \n    </div>\n   </div>\n  </div>\n </div>\n <div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Key Qualifications</b></h2> \n     </div>\n     <div>\n      <div>\n       <ul>\n        <li>Ideally, you'll have:</li> \n        <li>More than 2 years of experience as a Project Manager.</li> \n        <li>Extraordinary leadership and excellent in establishing good relationship with all parties involved.</li> \n        <li>Able to communicate well with multi-functional team members, provide positive feedback to them and collaborate with them to achieve project goals</li> \n        <li>Knowledge of the Hardware development process</li> \n        <li>Possess operations experience in a manufacturing environment</li> \n        <li>Knowledge in Display or Camera design will be an added advantage</li> \n        <li>English Fluency a must for both written and spoken</li> \n        <li>Self motivated and proactive in managing multi tasks under critical situation</li> \n        <li>Ability to speak in Korean is a plus</li> \n       </ul>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Description</b></h2> \n     </div>\n     <div>\n      <div>\n       In this role, you will: - Lead multi-functional communication between Apple Internal project teams and external vendors. - Work with Engineering Management and Vendors to define plan, track, communicate and call out as appropriate. - Provide timely issue resolution and critical path management. - Drive day-to-day Engineering build activities, at vendor’s factory, to meet overall program objectives.\n      </div> \n     </div>\n    </div>\n   </div>\n  </div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Education &amp; Experience</b></h2> \n     </div>\n     <div>\n      <div>\n       Degree/Master in Electrical, Electronic, Mechanical Engineering or equivalent.\n      </div> \n     </div>\n    </div>\n   </div>\n  </div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Additional Requirements</b></h2> \n     </div>\n     <div>\n      <div>\n       <ul>\n        <ul>\n         <li>Please submit any employer reference letter if available</li>\n        </ul>\n       </ul>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n </div>\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 13, "company": "MHS", "jobkey": "65b7d3ae0541d790", "jobTitle": "Senior Software Developer", "jobDescription": "<div>\n <div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <div>\n       <div>\n        <div>\n         FORTNA partners with the world’s leading brands to transform omnichannel and parcel distribution operations. Known world-wide for enabling companies to keep pace with digital disruption and growth objectives, we design and deliver solutions, powered by intelligent software, to optimize fast, accurate and cost-effective order fulfillment and last mile delivery. Our people, innovative approach and proprietary algorithms and tools ensure optimal operations design and material and information flow. We deliver exceptional value every day to our customers with comprehensive services and products including network strategy, distribution center operational design and implementation, material handling automated equipment, robotics and a comprehensive suite of lifecycle services.\n        </div>\n       </div>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n </div>\n <div></div>\n <div>\n   PRIMARY RESPONSIBILITIES INCLUDE\n </div>\n <ul>\n  <li> Designing and developing high quality distributed applications of FORTNA Warehouse Execution System (WES) – a real-time processing system.</li>\n  <li> Developing Proof of Concept implementations to establish the feasibility and demonstrating the application of new technology to new products or extensions to existing products.</li>\n  <li> Performing activities for hiring and training new developers.</li>\n  <li> Taking the lead in designing, implementing, and testing new software products and technologies.</li>\n  <li> Participating in designing, developing, and delivering solutions for end-users and Clients.</li>\n  <li> Assisting Software QA and Infrastructure Engineers in Qualifying, Deploying, and Packaging Company’s software product and libraries.</li>\n  <li> Assisting Software QA in the design and development of test plans and frameworks.</li>\n  <li> Maintaining high-quality software source code and design documentation.</li>\n  <li> Providing remote support and troubleshooting for clients' systems.</li>\n </ul>\n <div></div>\n <div>\n   REQUIRED QUALIFICATIONS\n </div>\n <div>\n   Must have:\n </div>\n <ul>\n  <li> Bachelor’s degree in computer science or engineering</li>\n  <li> +6 years of relevant experience with Java, especially with Network Programming, Multi-Thread Programming</li>\n  <li> Proficiency English (both Writing and Speaking)</li>\n  <li> Experience with Microservice, Socket Programming, RPM Package Manager, auto-build tools, SQL and Oracle, DLL plug-in libraries in C++, pthreads, XML, XSLT and ActiveMQ</li>\n  <li> Proficient in object-orientated analysis and design (OOAD) such as general design patterns and core object-oriented patterns</li>\n  <li> Experienced with some mix of SQL and Oracle, TCP/IP, JMS</li>\n  <li> Strong interpersonal, organizational, time management and problem-solving skills</li>\n  <li> Good at Data Structure and Algorithm, deep understanding of Design Pattern and Software Development Principles and Concepts</li>\n  <li> Must be a team player who works well with technical and non-technical resources.</li>\n </ul>\n <div>\n   Nice to have:\n </div>\n <ul>\n  <li> Time sensitive, high transaction-based processing experience</li>\n  <li> Experience with other open-source operating systems and development tools</li>\n  <li> Software development life cycle (SDLC) experience with a sizeable product/project</li>\n  <li> Excellent oral and written communication skills and the ability to clearly articulate to project members and stakeholders.</li>\n  <li> Guiding junior engineers</li>\n  <li> Having the desire to pick up and learn new technical skills.</li>\n </ul>\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 12, "company": "MHS", "jobkey": "ec2fd61c60132355", "jobTitle": "Support Engineer, Client Systems Operations", "jobDescription": "<div>\n <div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <div>\n       <div>\n        <div>\n         FORTNA partners with the world’s leading brands to transform omnichannel and parcel distribution operations. Known world-wide for enabling companies to keep pace with digital disruption and growth objectives, we design and deliver solutions, powered by intelligent software, to optimize fast, accurate and cost-effective order fulfillment and last mile delivery. Our people, innovative approach and proprietary algorithms and tools ensure optimal operations design and material and information flow. We deliver exceptional value every day to our customers with comprehensive services and products including network strategy, distribution center operational design and implementation, material handling automated equipment, robotics and a comprehensive suite of lifecycle services.\n        </div>\n       </div>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n </div>\n <div></div>\n <div>\n   Job Summary:\n </div>\n <div>\n   The Support Engineer’s role is to ensure the stability, integrity, and efficient operation of client information systems that support core Fortna software functions. This is achieved by monitoring, maintaining, supporting, and optimizing all client infrastructure systems and internal development environments. The Support Engineer will apply proven communication, analytical, and problem-solving skills to help identify, communicate, and resolve issues to maximize client success.\n </div>\n <div></div>\n <div>\n   Responsibilities:\n </div>\n <div>\n   Strategy &amp; Planning\n </div>\n <ul>\n  <li> Collaborate with the project implementation team and the client lifecycle performance team to ensure smooth and reliable operation of software and systems for fulfilling business objectives and processes.</li>\n  <li> Follow process and scheduled proactive tasks including patching, event management and alert response processes.</li>\n  <li> Work with cross-functional software and development teams to identify and resolve client systems issues.</li>\n  <li> Follow standard ITIL framework Problem management with detailed Root Cause Analysis.</li>\n </ul>\n <div></div>\n <div>\n   Operations and Support\n </div>\n <ul>\n  <li> Design and deploy new development systems on-premises and in public cloud environments.</li>\n  <li> Provide 24x7 escalation support on a rotating schedule for all client systems related incidents and support requests.</li>\n  <li> Respond to incidents following internal and client service level objectives.</li>\n  <li> Review and manage alerts, set thresholds, and respond to all alert and event records.</li>\n  <li> Follow and adhere to ITIL change management procedures.</li>\n </ul>\n <div></div>\n <div>\n   Proactive Managed Services\n </div>\n <ul>\n  <li> Apply OS patches and upgrades on a regular basis and upgrade administrative tools and utilities, as necessary.</li>\n  <li> Perform ongoing performance tuning, hardware upgrades, and resource optimization as required. Configure CPU, memory, and disk partitions as required.</li>\n  <li> Maintaining and reporting on data center environmental and power redundancy equipment.</li>\n  <li> Gauge the effectiveness and efficiency of existing systems; develop and implement strategies for improving or further leveraging these systems.</li>\n  <li> Design and perform server and security audits, system backup procedures, and other recovery processes in accordance with the disaster recovery and business continuity strategies.</li>\n  <li> Ensure system connectivity of all servers and shared software.</li>\n  <li> Create and maintain documentation as it relates to system configuration changes and service records.</li>\n  <li> Monitor and test system performance; prepare and deliver system performance statistics and reports.</li>\n </ul>\n <div></div>\n <div>\n   Required Knowledge, Skills, Abilities (must be able to be ascertained from the resume):\n </div>\n <ul>\n  <li> 2 years’ work experience in an IT support or system engineering role.</li>\n  <li> Strong experience in Linux RHEL/OEL/CentOS administration</li>\n  <li> Proven experience with systems planning, security principles, and general infrastructure management best practices.</li>\n  <li> Strong experience with VMware or other virtualization experience.</li>\n  <li> Excellent English Communication</li>\n  <li> Experience with Kubernetes or other application development orchestration and containerization tools.</li>\n  <li> Experience with automation tools like Ansible and Terraform.</li>\n  <li> Experience with public cloud Virtual machine, networking, storage and container solutions and support.</li>\n  <li> Network topology and infrastructure expertise</li>\n  <li> Strong understanding of Virtual Private Networking and other remote access tools.</li>\n  <li> Working knowledge of server and workstation infrastructure.</li>\n  <li> Strong understanding of high availability protocols and architecture.</li>\n  <li> Working knowledge of storage area network and network attached storage systems.</li>\n  <li> Working knowledge of Unix compliant command line interfaces.</li>\n  <li> Ability to understand and diagnose client-server architecture.</li>\n  <li> Proficient with other open-source operating systems and applications.</li>\n </ul>\n <div></div>\n <div>\n   Education and Experience:\n </div>\n <ul>\n  <li> University degree in computer science or software engineering and/or 2 years equivalent work experience.</li>\n  <li> VMware certification</li>\n  <li> ITIL Foundations</li>\n </ul>\n <div></div>\n <div>\n   Other Qualifications Desired:\n </div>\n <ul>\n  <li> Excellent oral and written communication skills and the ability to clearly articulate to project members and stakeholders; must be a team player who works well with technical and non-technical resources.</li>\n  <li> Ability to work in a high-paced, highly dynamic environment.</li>\n  <li> Ability to conduct research into systems issues and products as required.</li>\n  <li> Highly self-motivated and directed, with keen attention to detail.</li>\n  <li> Proven analytical and creative problem-solving abilities.</li>\n  <li> Able to prioritize and execute tasks in a high-pressure environment.</li>\n  <li> Strong customer service orientation.</li>\n  <li> Ability to work in a team-oriented, collaborative environment.</li>\n  <li> Strong interpersonal, organizational, time management and problem-solving skills</li>\n </ul>\n <div></div>\n <div>\n   Physical Requirements:\n </div>\n <ul>\n  <li> 40-hour hybrid (3 days onsite) work week with on-call availability for 10 days per month.</li>\n  <li> Sitting for extended periods of time.</li>\n  <li> When travelling to client sites, essential requirements of this position may require physical presence in various environments and locations. Physical stamina may be required for prolonged standing, bending, stooping, and/or working in cramped quarters. Exposure to potentially dangerous tools and equipment amidst a variety of building materials is probable, as is occasional exposure to moving mechanical parts.</li>\n  <li> The noise level in the work environment can vary from being relatively quiet, to moderate, to excessive. Safety shoes or boots may be required in certain situations. Additional safety clothing including gloves, hardhats, and devices to protect eyes, mouth, or hearing, will be worn, as necessary.</li>\n  <li> Dexterity of hands and fingers to operate a computer keyboard, mouse, power tools, and other computer components.</li>\n  <li> Lifting and transporting of moderately heavy objects, such as computers and peripherals.</li>\n  <li> Lifting and transporting of moderately heavy objects, such as computers, devices, and peripherals.</li>\n </ul>\n <div></div>\n <div>\n   Base Salary Range and Other Relevant Information:\n </div>\n <div>\n   The base salary range for this role is [x] to [x]. This base salary range represents the low and high end of the base salary range for this position. Actual base salary offered will vary based on various factors including but not limited to location, level, job-related knowledge, skills, experience, and performance.\n </div>\n <div></div>\n <div>\n   Travel Requirements:\n </div>\n <ul>\n  <li> 20% travel could be required.</li>\n </ul>\n <div></div>\n <div>\n  <i> It is the policy of all FORTNA companies to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, pregnancy or pregnancy-related condition, status with regard to public assistance, veteran status, citizenship status (if authorized to work in the U.S.), or any other characteristic protected by federal, state or local law.</i>\n </div>\n</div>\n<div></div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 11, "company": "AI&T", "jobkey": "f2d405bf52a3f95c", "jobTitle": "SOFTWARE DEVELOPER", "jobDescription": "<div>\n <h4 class=\"jobSectionHeader\"><b>JOB DESCRIPTION</b></h4> \n <ul>\n  <li>Development/implement all the company project (programming language: PHP/C/C++/Objective-C/Java).</li> \n  <li>In charge, project participants from the analysis phase and design characteristics of the project.</li> \n  <li>Manage, research to setup technology training, programming techniques to support other company projects when required.</li> \n </ul>\n <h5 class=\"jobSectionHeader\"><b>Company Projects:</b></h5> \n <ul>\n  <li>Smartphone games and applications (iPhone/iPad, Android …)</li> \n  <li>Social networks, social games.</li> \n  <li>System related to the network (TCP/IP, multimedia).</li> \n  <li>Web system, mobile web, web commerce.</li> \n  <li>Management system for businesses.</li> \n </ul>\n <p></p>\n <h4 class=\"jobSectionHeader\"><b>JOB REQUIREMENT</b></h4> \n <ul>\n  <li>Bachelor Degree in Computer Science/ Information Technology or equivalence.</li> \n  <li>Proficiency in at least 01 progamming language: PHP/C/C++/Objective-C/Java.</li> \n  <li>Willing to learn new knowledge.</li> \n  <li>High sense of responsibility, dynamic, teamwork spirit.</li> \n  <li>Good at arrangement of work.</li> \n  <li>Read and write English well.</li> \n </ul>\n <h5 class=\"jobSectionHeader\"><b>Preferred experience, skills:</b></h5> \n <ul>\n  <li>Experience in development of games and applications on Mobile/PC.</li> \n  <li>Having Japanese language to participate and support the team to manage configuration and change of requirements after receiving information from customer.</li> \n  <li>Able and willing to assume various positions/multi-tasking work.</li> \n  <li>Good skills in technical management, software project management.</li> \n  <li>Ability and preferred to documentation technique.</li> \n </ul>\n <p></p>\n <h4 class=\"jobSectionHeader\"><b>Comprehensive benefits</b></h4> \n <ul>\n  <li>The 13th month bonus and year-end business bonus;</li> \n  <li>2 times / year salary review or irregular review for excellent members;</li> \n  <li>Tet holidays bonus;</li> \n  <li>Travel allowance (calculated according to the distance from home to the company); </li>\n  <li>Monthly team activity allowance;</li> \n  <li>References bonus: a reward of 1 ~ 10 million VND for anyone who introduces friends and acquaintances to the company;</li> \n  <li>Social insurance, health insurance and unemployment insurance, 12 days of leave / year;</li> \n  <li>Everyone’s health is the health of the company: Annual health check-ups and advanced health insurance (PVI) for every member;</li> \n  <li>Working time: working from Monday to Friday, off Saturday &amp; Sunday.</li> \n </ul>\n <h4 class=\"jobSectionHeader\"><b>Reasons to choose AI&amp;T</b></h4> \n <ul>\n  <li>Opportunities for professional and career growthThe project’s content covers in various fields: architecture, system design, server design, program, Optimal, CI / CD …</li> \n  <li>The variety and modern in project technology, opportunities in quickly becoming full stack engineer;</li> \n  <li>The simplicity and sincere in company culture, colleagues’s willing to help and a potential land for self-development</li> \n  <li>Suitable efficiency review (2 times /year review);</li> \n  <li>Providing with a full range of modern equipment, latest macbook / laptop, 2 screens … to improve working efficiency;</li> \n  <li>Advanced treatment for members who can promote Japanese in work</li> \n  <li>Free to join courses on the company’s Udemy business account</li> \n  <li>Work and rest are always focused on balance:<br> + Traveling inside / outside the country every year<br> + Regular event activities: monthly birthdays, big and small holidays (8/3, 20/10, 1/6,…), sports activities<br> + Working environment: dynamic, friendly staff, modern office </li> \n </ul>\n <p>You are invited to learn more on <b>our facebook </b></p>\n <p><b><i>Preferred language(For applications): English</i></b></p> \n <p><i> **Contact for further discussion:</i></p> \n <ul> \n  <li>Phone: +84-24-3762-4015 </li>\n  <li>Email: tuyendung@ai-t.vn</li>\n </ul>\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 10, "company": "Asilla", "jobkey": "62a8678c1b2c13c1", "jobTitle": "Software Engineer (Python/C++)", "jobDescription": "<div>\n <div>\n  <div>\n   <div>\n    Asilla\n   </div>\n   <div>\n    <div>\n     <br> \n    </div>\n   </div>\n  </div>\n </div>\n <div></div>\n <div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <div> \n      </div> \n     </div>\n    </div>\n   </div>\n  </div>\n  <p></p>\n  <div>\n   <div>\n    <div>\n     Tầng 3, số 6 ngõ 82 Duy Tân, phường Dịch Vọng Hậu, Cau Giay, Ha Noi \n    </div>\n    <div></div>\n    <div>\n     <div>\n      At office \n     </div> \n    </div>\n    <div>\n     Posted 22 days ago \n    </div>\n    <div>\n     Skills: \n     <div>\n      Python \n     </div>\n     <div>\n      Linux \n     </div>\n     <div>\n      C++ \n     </div>\n    </div>\n   </div>\n  </div>\n </div>\n <div>\n  <div>\n   <h2 class=\"jobSectionHeader\"><b>Top 3 reasons to join us</b></h2> \n   <ul>\n    <li>14 tháng lương một năm</li> \n    <li>Cơ hội nhận Stock Option, full bảo hiểm xã hội</li> \n    <li>Môi trường cực thoải mái, không khuyến khích OT</li> \n   </ul>\n  </div>\n  <div></div>\n  <div>\n   <h2 class=\"jobSectionHeader\"><b>Job description</b></h2> \n   <p> Tham gia vào các dự án xây dựng sản phẩm của Asilla trong mảng Computer Vision có sử dụng công nghệ Deep Learning. Các sản phẩm của công ty bao gồm: nhận diện hành động bất thường thông qua camera giám sát, multiple camera tracking, human pose estimation.</p>\n   <div>\n     Cụ thể:\n    <br> \n    <ul>\n     <li>Xây dựng các ứng dụng, tích hợp hệ thống sử dụng model AI</li>\n     <li>Làm việc với các thiết bị Jetson Nano, TX2, Xavier</li>\n     <li>Làm việc với các hệ thống server tại chỗ hoặc trên nền tảng Cloud AWS</li>\n    </ul>\n   </div> \n  </div> \n  <div></div>\n  <div>\n   <h2 class=\"jobSectionHeader\"><b>Your skills and experience</b></h2> \n   <ul>\n    <li>Tốt nghiệp đại học chuyên ngành CNTT hoặc tương đương</li> \n    <li>Tối thiểu 1,5 năm kinh nghiệm phát triển hệ thống trên Python hoặc C++, OpenCV</li> \n    <li>Thành thạo với môi trường Linux</li> \n    <li>Hiểu biết tốt về lập trình hướng đối tượng, đa luồng</li> \n    <li>Tư duy logic tốt, chăm chỉ và có trách nhiệm trong công việc</li> \n    <li>Có đam mê, và thích hợp với môi trường startup</li> \n   </ul>\n  </div>\n  <div></div>\n  <div>\n   <h2 class=\"jobSectionHeader\"><b>Why you'll love working here</b></h2> \n   <ul>\n    <li>Mức lương cạnh tranh: upto $2000 x 14 tháng lương một năm.</li> \n    <li>Cơ hội nhận thưởng cổ phần.</li> \n    <li>Được tham gia đầy đủ các chế độ của Nhà nước quy định như: BHXH, BHYT, BHTN, ngày nghỉ phép năm.</li> \n    <li>Được đào tạo và làm việc trực tiếp với những chuyên gia nhiều kinh nghiệm trong lĩnh vực AI.</li> \n    <li>Có cơ hội làm những việc thách thức, phát huy hết khả năng bản thân.</li> \n    <li>Tham gia các buổi teambuilding, du lịch 2-3 lần/năm;</li> \n    <li>Được hưởng đầy đủ các chế độ phúc lợi (Hiếu hỉ, sinh nhật...);</li> \n    <li>Môi trường làm việc trẻ trung, thoải mái, tinh thần startup năng động.</li>\n   </ul>\n  </div>\n </div>\n</div> \n<br>\n<div>\n <div>\n  <div>\n   <h3 class=\"jobSectionHeader\"><b>Asilla</b></h3>\n   <div>\n    <br> \n   </div>\n  </div>\n </div>\n <div>\n  <p>Start-up tiên phong trong mảng trí tuệ nhân tạo</p> \n </div> \n <div>\n  <div>\n   <div>\n    Company type \n   </div>\n   <div>\n    Product \n   </div>\n  </div>\n  <div>\n   <div>\n    Company size \n   </div>\n   <div>\n    51-150 employees \n   </div>\n  </div>\n  <div>\n   <div>\n    Country \n   </div>\n   <div>\n    <div>\n     Vietnam\n    </div> \n   </div>\n  </div>\n  <div>\n   <div>\n    Working days \n   </div>\n   <div>\n    Monday - Friday \n   </div>\n  </div>\n  <div>\n   <div>\n    Overtime policy \n   </div>\n   <div>\n    No OT\n   </div>\n  </div>\n </div>\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 9, "company": "Qorvo", "jobkey": "e672af03610dacd7", "jobTitle": "Embedded Software Test Engineer", "jobDescription": "<div>\n <div>\n  <div>\n   <div>\n    <div>\n     <h1 class=\"jobSectionHeader\"><b>Embedded Software Test Engineer </b></h1>\n    </div>\n   </div>\n  </div>\n </div>\n <div>\n  <div>\n   <div>\n    <div>\n     Experience Level: Individual Contributor \n    </div>\n   </div>\n  </div>\n </div>\n <div>\n  <div>\n   <div>\n    <div>\n     Job Type: Full-Time \n    </div>\n   </div>\n  </div>\n </div>\n <div>\n  <div>\n   <div>\n    <div>\n     Location: Vietnam - Hanoi, VN \n    </div>\n   </div>\n  </div>\n </div>\n <div>\n  <div>\n   <div>\n    <div>\n     Requisition ID: 5708 \n    </div>\n   </div>\n  </div>\n </div>\n <div></div>\n <div>\n  <div>\n   <div>\n    <div>\n     <p><b>Responsibilities</b><b>:</b></p> \n     <ul>\n      <li>Plan and design project Software Test strategy and, execute it along with the Firmware team.</li> \n      <li>Design, creation, automation, and execution of test content to ensure the correct functionality of PACs application.</li> \n      <li>Create test plans, procedures, and infrastructure.</li> \n      <li>Documentation of test items, deliverables, and artifacts.</li> \n      <li>Execute tests according to defined test procedures and scenarios.</li> \n      <li>Identify and log defects after test cycles.</li> \n      <li>Assist with classification, management, and resolution of software defects.</li> \n      <li>Be part of technical reviews for the specification of software requirements, architecture and designs.</li> \n      <li>Follow established quality processes and standards for formal delivery of test artifacts.</li> \n      <li>Look for in-depth solutions for engineering problems, improve or develop new methods and approaches with product applications to ensure quality, efficiency, and cost effectiveness.<b> </b></li>\n     </ul>\n     <p><b>Qualifications: </b></p>\n     <ul>\n      <li>A minimum of a Bachelor’s degree in Computer Engineering, Electrical Engineering, Computer Science or related degree is required for this position.</li> \n      <li>Minimum of 4 years of experience in Firmware/Software Validation and Verification.</li> \n      <li>Familiar with firmware testing methodologies, including functional, performance and regression testing.</li> \n      <li>Understanding embedded firmware development process.</li> \n      <li>Software Unit, Integration and Qualification testing.</li> \n      <li>Knowledge of test automation frameworks and scripting languages.</li> \n     </ul>\n     <ul>\n      <li>Proficiency in programming languages such as C/C++ and Python.</li> \n      <li>Experience with firmware testing tools, such as debuggers and emulators, measurement instruments, oscilloscopes, power supplies, etc.</li> \n      <li>Experience with C#.NET is advanced.</li> \n      <li>Understanding of hardware components and interfaces, such as microcontrollers, I2C, SPI and UART communication protocols.</li> \n      <li>Knowledge and experience with Version Control Systems (VCS): GIT, etc.</li> \n      <li>Good time-management skills with the ability to multi-task and collaborate cross-team on multiple projects.</li> \n     </ul> \n     <p>MAKE A DIFFERENCE AT QORVO We are Qorvo. We do more than create innovative Analog and RF solutions for the mobile, defense and infrastructure markets – we are a place to innovate and shape the future of wireless communications. It starts with our employees. As a unified global team, we bring a commitment to excellence, growth and a passion for creating what's next. Explore the possibilities with us.</p>\n     <br> \n     <p></p> \n     <p><b><i>#LI-MP1</i></b> </p>\n    </div>\n   </div>\n  </div>\n </div>\n <div></div>\n <div>\n  <div>\n   <p>Qorvo is an E-Verify Employer. For more information, please see the Right to Work and E-Verify Participation posters.</p>\n  </div>\n </div>\n</div>\n<p></p>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 8, "company": "Kpim", "jobkey": "70a04d62e589dfcc", "jobTitle": "Software Engineer", "jobDescription": "<b>Giới thiệu:</b>\n<br> Công ty Cổ phần KPIM chuyên Đào tạo, Tư vấn và Triển khai Phân tích dữ liệu và Xây dựng hệ thống báo cáo cho khách hàng doanh nghiệp \n<br>\n<ul> \n <li>Tham gia phát triển các sản phẩm, xây dựng các hệ thống nghiệp vụ khác theo yêu cầu.</li> \n <li>Xây dựng giao diện sử dụng trên Web, Mobile, phối hợp với các bộ phận để nắm bắt yêu cầu, phát triển sản phẩm, bộ phận thiết kế để hoàn thiện sản phẩm chất lượng nhất.</li> \n <li>Tham gia thiết kế, xây dựng API để đảm bảo ứng dụng hoạt động tốt, dễ dàng mở rộng và tích hợp với các hệ thống khác.</li> \n <li>Triển khai, nâng cấp, bảo trì hệ thống trên các nền tảng AWS, Google Cloud Platform, Azure</li> \n <li>Nghiên cứu, áp dụng các công nghệ mới.</li> \n</ul> \n<b>Địa điểm làm việc:</b> Hà Nội \n<br>\n<b>Lương:</b> 15000K - 20000K VND một tháng \n<br>\n<b>Loại hình công việc:</b> Thỏa thuận thời gian \n<br>\n<b>Yêu cầu:</b> Cover Letter, CV \n<br>\n<b>Quyền lợi:</b> Chế độ bảo hiểm, Thưởng doanh thu, Cơ Hội Phát Triển, Du Lịch \n<br>\n<b>Hạn nộp:</b> 2023-10-21 \n<br>\n<b>Kinh nghiệm:</b> 1 - 2 năm \n<br>\n<b>Bằng cấp:</b> Đại học \n<br>\n<b>Lĩnh vực:</b> IT/CNTT -IT Phần mềm \n<br>\n<b>Số lượng cần tuyển:</b> 2 \n<br>\n<b>Giới tính:</b> Không yêu cầu"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 7, "company": "Miyatsu", "jobkey": "b2b02eaac836dbc1", "jobTitle": "C++ Engineer", "jobDescription": "<div></div>\n<div>\n <div>\n  <div>\n   Number of Position: 01\n  </div> \n  <div>\n    Location: Hanoi\n  </div>\n  <br> \n  <div></div> \n  <div>\n    Job description\n  </div>\n  <br> \n  <div></div> \n  <ul> \n   <div>\n    Salary: $1,200 – $2,200 (14 months salary/year)\n   </div> \n   <div>\n    Join Bitcoin projects with the top partners in Japan\n   </div> \n   <div>\n    Research and develop projects\n   </div> \n   <div>\n    Planning and managing programing progress to ensure everything goes according to plan\n   </div> \n   <div>\n    Participate in the process of designing and reviewing source code for the team\n   </div> \n  </ul> \n  <ul>\n   <li>Our team comprises passionate and enthusiastic coders. We are well trained in software engineering from the largest information technology universities in Vietnam and in the world. We are currently developing software related to finance, mathematics, security, etc, for leading Japanese clients. Due to the need of expanding the team, we would like to add more members who are not afraid of any language, passionate for technology, and not afraid to fix bugs. Job details will be discussed at the interview.</li>\n  </ul>\n  <br> \n  <div></div> \n  <div>\n    Requirements\n  </div>\n  <br> \n  <div></div> \n  <ul> \n   <div>\n    Passionate and experience in programming (2 or more years of experience)\n   </div> \n   <div>\n    Creative thinking, independent, flexible, able to develop software/systems from the beginning\n   </div> \n   <div>\n    Good logical and algorithmic thinking, problem solving skills\n   </div> \n   <div>\n    Programming language: C++ (Plus: Node JS, Angular JS…)\n   </div> \n   <div>\n    Attention to detail, hardworking, eager to learn\n   </div> \n   <div>\n    Good understanding of English, will receive training about the project\n   </div>\n  </ul>\n  <br> \n  <div></div> \n  <div></div>\n  <div>\n    Prioritise:\n  </div> \n  <ul> \n   <div>\n    Candidates who are strong in maths, IT, logic (high school specialised in Mathematics, IT, won national prizes in Mathematics, IT) or candidates with Masters’ degree or PhD in Information Technology abroad\n   </div> \n   <div>\n    Candidates with experience in developing a complete software or took part in most of the process (required various skills, from analysis, structural design and algorithm, to testing and fix bug)\n   </div> \n   <div>\n    Candidates with experience in working with Linux, opensource software, security and hacking\n   </div>\n  </ul>\n  <br> \n  <div></div> \n  <div>\n    Apply\n  </div>\n  <br> \n  <div></div> \n  <ul> \n   <div>\n    Option 1: Fill in the form below\n   </div> \n   <div>\n    Option 2: Send your CV to hr@13.229.182.113, with the subject[Miyatsu Vietnam] Apply for C++ Engineer\n   </div>\n  </ul>\n </div>\n</div>\n<div></div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 6, "company": "Neos Vietnam International", "jobkey": "fb763fe57c859ef4", "jobTitle": "AI Engineer", "jobDescription": "<div></div>\n<div>\n <div>\n  <div>\n   <div>\n    <p>Computer Science Fundamentals and Programming (include data structures, algorithms, computability and complexity, computer architecture, etc.) Probability and Statistics Data Modeling and Evaluation Applying Machine Learning Algorithms (regression, decision tree, nearest neighbor, neural net, support vector machine, ensemble of multiple models, etc.) and Libraries (e.g. scikit-learn, Theano, MLlib, TensorFlow etc.) Software Engineering and System Design (including requirements analysis, system design, modularity, version control, testing, documentation, etc.)</p> \n   </div>\n   <br> \n   <div>\n    <div>\n     <b>Ưu tiên</b>\n    </div> \n    <p>Ability to read/write/communicate in English or Japanese. Japanese is preferred Highly motivated and business driven professional with a can-do attitude. Experience as researcher and engineer in the area of data analytics, machine learning, computer vision or other AI related field is prefer</p> \n   </div>\n   <br> \n   <div>\n    <div>\n     <b>Mức lương</b>\n    </div> \n    <ul>\n     <li>Negotiation</li>\n    </ul>\n   </div>\n  </div>\n </div>\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 5, "company": "Picket Homes", "jobkey": "a921562b9fa5a432", "jobTitle": "Full Stack Engineer", "jobDescription": "<div>\n <div>\n  Picket is a technology-powered real estate company that is transforming the single-family home rental market at every stage of the value chain, from the way investors acquire and manage high-quality rental properties, to the quality, service, and flexibility residents enjoy when they live in them.\n </div>\n <div> \n </div>\n <div>\n   Our proprietary Decision Science platform uses advanced data science and machine learning to identify homes that fit investor criteria and optimize portfolio management and performance at scale.\n </div>\n <div></div>\n <div>\n  <br> We are seeking a senior software developer who has passion and ability to build “full-stack” customer-facing products at a fast pace. We have employed several technologies, but the product engineer would likely be working with \n  <b>ReactJS on the frontend and NodeJS on the backend</b>. You will work closely with product leaders, Fortune-500 clients, real estate professionals, and teammates to build, deploy, and iterate on amazing products on a frequent launch cadence.\n  <br> \n </div>\n <div></div>\n <br> \n <div>\n  We are always open to any candidates as long as we believe that Picket would be able to provide you with an environment for you to grow, develop, and build our company together. Hence, if you have a strong product ownership and are looking for a place to grow your career and impact millions of people, Picket might be just the right place for you.\n </div> \n <h3 class=\"jobSectionHeader\"><b>MINIMUM QUALIFICATION</b></h3>\n <ul>\n  <li> 5+ years of experience in JavaScript, building, supporting, and scaling distributed RESTful API</li>\n  <li> Demonstrated extreme proficiency in Node.js</li>\n  <li> Demonstrated experience and deep understanding of React</li>\n  <li> Proficiency in SQL and NoSQL databases: PostgreSQL, MongoDB</li>\n  <li> Thorough understanding of CI lifecycle including best practices in QA and deployment</li>\n  <li> Experience with Microservices Architecture</li>\n  <li> Understanding of CI/CD, Git</li>\n  <li> Knowledge of Redis</li>\n  <li> Basic experience with AWS, GCP, or similar cloud and infrastructural services</li>\n  <li> Self-motivated, organized, customer-obsessed, with a high level of integrity and ethics</li>\n  <li> Sufficient English communication skills (both verbal and written)</li>\n </ul>\n <h3 class=\"jobSectionHeader\"><b> PREFERRED QUALIFICATION</b></h3>\n <ul>\n  <li> Demonstrated extreme proficiency in at least one other (than JavaScript) language (preferably Java/Kotlin or other JVM languages)</li>\n  <li> Demonstrated experience in developing applications using the FastAPI framework with Python.</li>\n  <li> Experience with React Hooks, Axios, Ant, Styled Components, Storybook/Jest</li>\n  <li> Experience in asynchronous event processing in the Microservice world (PubSub, Apache Kafka) or similar technologies</li>\n  <li> Experience with studying abroad and/or working in global teams</li>\n </ul>\n <h3 class=\"jobSectionHeader\"><b> TOP 3 REASONS TO JOIN US</b></h3>\n <ul>\n  <li> Super fast growing Start-up with an autonomous working culture</li>\n  <li> Work with experienced software engineers in US, Poland and Ukraine</li>\n  <li> Fun place to work with competitively attractive salary and benefits</li>\n </ul>\n <h3 class=\"jobSectionHeader\"><b> SALARY &amp; BENEFITS</b></h3>\n <ul>\n  <li> Community of people who do their jobs with integrity and dedication to service</li>\n  <li> Competitive compensation package with incentives, including stock options</li>\n  <li> Performance review every 6 months</li>\n  <li> Premium life insurance package (health insurance included) </li>\n  <li>Annual health check</li>\n  <li> Onsite opportunity including short-term assignments in the U.S</li>\n  <li> Open working space with modern equipment (Macbook, monitors and anything you need!)</li>\n  <li> Flexible working model and unlimited vacation policy</li>\n </ul>\n <h3 class=\"jobSectionHeader\"><b> OUR PROCESS</b></h3>\n <ul>\n  <li> Cultural screening</li>\n  <li> Short tech task<i> (Please ensure your Github or other types of portfolio showing your most up-to-date code samples. If the materials are not sufficient, we would require this step for better judgement) </i></li>\n  <li>Hiring manager interview</li>\n  <li> Technical interviews</li>\n  <li> Conversation with CEO/CTO, Quinten \"Q\" Shay</li>\n </ul>\n <div></div>\n <div>\n  <br> Picket is venture funded, and founded by a team of entrepreneurs and executives from top technology, real estate, and investment companies (Amazon, Google, Microsoft, etc.). Our team has been increasing from 11 to more than 100 employees within the last 18 months and will definitely continue to grow in the future. Let become a Picketeer and join the journey with us!!!\n  <br> \n </div>\n <div></div>\n <br> \n <div>\n  We do not accept solicitations from third-party recruiters for any positions. A background check is required for this position. Picket is an equal-opportunity employer that celebrates diversity and we welcome applicants from all backgrounds.\n </div>\n <div></div>\n <div>\n  <br> At Picket Homes, we are building something new and different - come build with us.\n </div>\n <div></div>\n <div>\n  <br> #LI-Hybrid\n </div>\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 4, "company": "KSE High-Tech", "jobkey": "ef6932a4421c8b09", "jobTitle": "Software Engineer", "jobDescription": "<div>\n <div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <div>\n       <div>\n        <div>\n         <div>\n          <div>\n           <p>General Information (for full-time positions)</p> \n           <ul>\n            <li>Location: KSE Hanoi Office or remote.</li> \n            <li>Highly competitive salary package, a 13th-month salary included with bi-annual performance-based bonuses.</li> \n            <li>Working time: 7.5 hours per day, 5 days per week.</li> \n            <li>Premium healthcare.</li> \n            <li>Annual leave, insurance, and policy following Labor Law.</li> \n           </ul>\n           <p>How to apply: Send your resume and a cover letter to contact@kse-solutions.com</p>\n          </div>\n         </div>\n        </div>\n       </div>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n </div>\n</div> \n<br>\n<div>\n <div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <div>\n       <div>\n        <div>\n         <div>\n          <div>\n           <ul>\n            <li>A minimum of 01 years of experience as software developer</li> \n            <li>Proven experience in working with one of the following programing languages: Java, C/C++, .Net, Python, PHP, Javascript/NodeJS.</li> \n            <li>Database: MySQL, SQL Server, Postgres SQL, Oracle.</li> \n            <li>Good HTML/CSS</li> \n            <li>Proven experience with NodeJS, MongoDB, DevOps is an advantage</li> \n            <li>English or Japanese (N4 or above) language skill is an advantage.</li> \n           </ul>\n           <h5 class=\"jobSectionHeader\"><b>Job Description:</b></h5> \n           <ul>\n            <li>Develop new web apps and enterprise applications.</li> \n            <li>To be trained or self-train on new technologies.</li> \n            <li>Learn and use AI technology for building our software.</li> \n            <li>Develop AI solutions, embedded and IoT systems.</li>\n           </ul>\n          </div>\n         </div>\n        </div>\n       </div>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n </div>\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 3, "company": "NashTech", "jobkey": "ae096c8a2c602bc8", "jobTitle": "Senior Software Engineer", "jobDescription": "<div>\n <div>\n  <h3 class=\"jobSectionHeader\"><b>Description</b></h3> \n  <div>\n   <ul>\n    <li>Develop and maintain database scripts, functions, stored procedures to support application development.</li> \n    <li>Develop and maintain ETL solution.</li> \n    <li>Assist Developers/Testers with database activities.</li> \n    <li>Process the client’s requests, feedback and fix the bugs.</li> \n    <li>Troubleshoot database performance related and tune complex database queries.</li> \n    <li>Participate in database design, ETL architecture design.</li> \n    <li>Review SQL statements and stored procedures written by developers.</li> \n    <li>Attend all regular meetings of the assigned projects.</li> \n   </ul>\n  </div>\n </div>\n <div>\n  <h3 class=\"jobSectionHeader\"><b>Qualifications</b></h3> \n  <div>\n   <ul>\n    <li>3+ years of experience in database development and administration</li> \n    <li>Hands-on development experience with at least 2 related databases such as SQL Server, Oracle, PostgreSQL, MySQL</li> \n    <li>Knowledge in database architecture, data modeling, schema design and development</li> \n    <li>Strong experience in Database Performance Tuning and Query Optimization</li> \n    <li>Experience in Data migration</li> \n    <li>Good awareness of Enterprise Data warehouse (EDW)/Business Intelligence (BI) solution</li> \n    <li>Able to work independently with good self-motivation and good self-management.</li> \n    <li>Good in English communication skills, good team player</li>\n   </ul>\n   <br> \n   <p></p> \n   <h2 class=\"jobSectionHeader\"><b> Why You'll Love Working Here</b></h2> \n   <ul>\n    <li>13-month salary per year</li> \n    <li>Performance bonus (up to 2-month salary)</li> \n    <li>Flexible option bonus for good performers &amp; retention bonus for outstanding performers</li> \n    <li>Social – Health – Insurance paid fully.</li> \n    <li>Healthcare: Annual health check-up, Premium Health Insurance (plus 1 slot for your dependent)</li> \n    <li>Annual leaves: 14 ~ 18 days</li> \n    <li>Clubs program: Football, Badminton, Swimming, Tennis, Rock, Yoga…</li> \n    <li>Training courses: Technical skills – Soft skills – English</li> \n   </ul> \n   <p>People are extremely important to us and that’s why we have a clear vision: to make NashTech a great place to work in its sector. We pride ourselves on:</p> \n   <ul> \n    <li>Professional and Flexible Working Environment</li> \n    <li>Great Teamwork</li> \n    <li>International Assignments</li> \n   </ul> \n   <p>WeCare - WeShare - WeDare - WeInnovate Engagement Program</p>\n  </div>\n </div>\n</div>\n<div></div> \n<br>\n<div>\n <div>\n  <div>\n   <div>\n    Location: \n   </div>\n   <div>\n    Ha Noi, Ho Chi Minh \n   </div>\n  </div>\n  <div>\n   <div>\n    Experience: \n   </div>\n   <div>\n    3+ years \n   </div>\n  </div>\n  <div>\n   <div>\n    Qualifications: \n   </div>\n   <div>\n    Bachelor Degree, College Degree, Master Degree \n   </div>\n  </div>\n  <div>\n   <div>\n    PERM/TEMP: \n   </div>\n   <div>\n    Permanent\n   </div>\n  </div>\n </div>\n</div>\n<p></p>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 2, "company": "Rikkeisoft", "jobkey": "e1854015b6fd49b4", "jobTitle": "Embedded Software Engineer", "jobDescription": "<p></p>\n<div>\n <div>\n  <ul>\n   <li><p><b>Địa Điểm</b></p><p> Hà Nội</p></li>\n   <li><p><b> Trình Độ</b></p><p> All Levels</p></li>\n   <li><p><b> Mức Lương</b></p><p> UPTO 40M</p></li>\n   <li><p><b> Ngày Hết Hạn</b></p><p> 01/12/2023</p></li>\n  </ul>\n </div>\n <div>\n  <h2 class=\"jobSectionHeader\"><b> Mô Tả Công Việc</b></h2>\n  <div>\n    Participate in the design, coding and testing of software for project equipment (Infotainment system). Coding and fixing issues of Real time core in the project. Coding and fixing issues for information, entertainment, intelligence and connectivity features in the project\n  </div>\n  <h2 class=\"jobSectionHeader\"><b> Yêu Cầu</b></h2>\n  <div>\n    C programming language. Knowledge of autosar classic. CAN protocol. Used to develop application layers in autosar. Used to work with automotive chip real time core. Unit test in C language. Autosar configuration. Used to use vector toolchain ( CANoe, Can analysis…) Real time OS concept. Work with Telematics + Multimedia project/system before.\n  </div>\n  <h2 class=\"jobSectionHeader\"><b> Quyền Lợi</b></h2>\n  <div>\n    Salary: Negotiate after interview Package: at least 13 months/ year. Review twice per year. Bonus: Tet bonus, project bonus, holiday bonus, HR referral bonus... Seniority allowance (working time from 2 years or more). Participate in learning and training activities inside and outside the company, accumulate learning points, develop G Points on the company's management system. Leave Saturday, Sunday + 12 days of leave/year Clubs and many cultural sports art activities sponsored or supported by the company (For example: Football, table tennis, badminton, swimming, music, English, games... ) Ensure health: Periodic health check, support to buy high quality health insurance... Join the Rikkei Care Health Insurance Plan. Mental comfort: Playing music on demand every day, fresh fruit, team building activities... Going out near and far everywhere. Opportunity to work abroad and travel around.\n  </div>\n </div>\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 1, "company": "Eureka Robotics", "jobkey": "9df2712fbba9d33c", "jobTitle": "Software Application Engineer", "jobDescription": "<div>\n Software Application Engineer at Eureka Robotics\n <br> October 2023\n <br> Company presentation\n <br> Empowered by Robotics and AI research from NTU Singapore, MIT, and the University of\n <br> Tokyo, Eureka Robotics delivers robotic software and systems to automate tasks that require\n <br> High Accuracy and High Agility (HA-HA).\n <br> With offices in Singapore, France, Vietnam, Japan and distribution partners in China and the\n <br> USA, Eureka Robotics prides itself on helping clients, globally, achieve vastly improved\n <br> productivity, lower costs, and better safety. Common uses include Inspection, Precision\n <br> Handling, 3D Picking, Assembly, or Dispensing.\n <br> Want to know more about us? Visit https://www.eurekarobotics.com or follow us on\n <br> https://www.linkedin.com/company/eurekarobotics.\n <br> To apply for this position, please send an email (with your CV)\n <br> Roles\n <br> As a Software Application Engineer, your mission is to help integrate our Robotics and AI\n <br> products, technologies, and services into our partners’ products.\n <br> You will cover a wide range of work including software application design, development,\n <br> testing, as well as system integration.\n <br> Job responsibilities:\n <br> \n <ul>\n  <li>Cooperate with Eureka’s back-end team to develop custom applications for our</li>\n </ul> partners based on Eureka’s core Robotics and AI technologies and products (Eureka\n <br> Controller, Eureka 3D Camera)\n <br> \n <ul>\n  <li>Work with Eureka’s field engineers and our partner’s engineers in Japan and Korea</li>\n </ul> to deploy the applications into our partner’s products\n <br> Qualifications\n <br> Minimum\n <br> \n <ul>\n  <li>2+ years of software development experience in an Agile environment</li>\n  <li>BSc degree or higher in Computer Science, Computer Engineering, or related fields,</li>\n </ul> or equivalent academic or work experience\n <br> \n <ul>\n  <li>Intermediate level in Python</li>\n  <li>Product development experience related to IT / embedded system / AI</li>\n  <li>Familiarity with software development tools such as git and shell scripting</li>\n  <li>Some background in algorithmics (complexity) and mathematics (linear algebra,</li>\n </ul> probability, statistics)\n <br> \n <ul>\n  <li>Ability to work at a fast-paced, high-pressure environment</li>\n  <li>English: Intermediate level or above</li>\n  <li>Honest, detail-oriented, careful, high sense of responsibility, team player</li>\n </ul> Preferred\n <br> \n <ul>\n  <li>5+ years of software development experience in an Agile environment</li>\n  <li>Familiarity with professional working processes (presentation, document writing,</li>\n </ul> planning, time management)\n <br> \n <ul>\n  <li>Proficiency in Python and C++ programming</li>\n  <li>Solid background in algorithmics (proof of correctness, complexity in time and space)</li>\n </ul> and mathematics (linear algebra, probability, statistics)\n <br> \n <ul>\n  <li>Knowledge of Robotics (kinematics, calibration, motion planning)</li>\n  <li>Knowledge of Computer Vision and AI (deep learning framework and tools)</li>\n  <li>Basic level of CAD design / electrical design</li>\n  <li>Japanese: Intermediate level or above</li>\n </ul> Benefits\n <br> \n <ul>\n  <li>Remuneration: competitive package comprising salary and stock options</li>\n  <li>Regular field trips to Japan / Korea to support our deployments</li>\n  <li>Health coverage</li>\n  <li>Flexible working hours, flexible work-from-home arrangement</li>\n </ul> Work location\n <br> Eureka Robotics office in Hanoi, Vietnam.\n</div>"},
{"keyword": "software engineer", "location": "Hà Nội", "page": 1, "position": 0, "company": "Picket Homes", "jobkey": "20b0c230fcd5360c", "jobTitle": "JavaScript/React Engineer", "jobDescription": "<div>\n <div>\n  Picket is a technology-powered real estate company that is transforming the single-family home rental market at every stage of the value chain, from the way investors acquire and manage high-quality rental properties, to the quality, service, and flexibility residents enjoy when they live in them.\n </div>\n <div> \n </div>\n <div>\n   Our proprietary Decision Science platform uses advanced data science and machine learning to identify homes that fit investor criteria and optimize portfolio management and performance at scale.\n </div>\n <div></div>\n <div>\n  <br> Picket is seeking a software developer who has passion and ability to build customer-facing products at a fast pace. We have employed several technologies, but the product engineer would likely be working with ReactJS. You will work closely with product leaders, Fortune-500 clients, real estate professionals, and teammates to build, deploy, and iterate on amazing products on a frequent launch cadence.\n </div>\n <div></div>\n <div>\n  <br> We are always open to any candidates as long as we believe that Picket is able to provide you with an environment for you to grow, develop, and build our company together. Hence, if you have a strong product ownership and are looking for a place to grow your career and impact millions of people, Picket might be just the right place for you.\n </div> \n <h3 class=\"jobSectionHeader\"><b>MINIMUM QUALIFICATIONS</b></h3>\n <ul>\n  <li> 2+ years of proven experience in developing and shipping high-quality web applications</li>\n  <li> Proficiency in TypeScript and functional React</li>\n  <li> Self-motivated, organized, customer-obsessed, with a high level of integrity and ethics</li>\n  <li> Sufficient English communication skills (both verbal and written)</li>\n </ul>\n <h3 class=\"jobSectionHeader\"><b> PREFERRED QUALIFICATIONS</b></h3>\n <ul>\n  <li> Knowledge of React ecosystem and toolings, such as react-query, redux, styled-systems, etc.</li>\n  <li> Knowledge of modern web applications and toolings, such as performance optimization, SEO, different testing frameworks, etc.</li>\n  <li> Knowledge of end-to-end web architecture, such as databases, RESTful APIs development, security, and best practices</li>\n  <li> Attention to code organization and details</li>\n  <li> Demonstrate ability to share knowledge, review code, translate business requirements to technical requirements, and take ownership of your work.</li>\n </ul>\n <h3 class=\"jobSectionHeader\"><b> TOP 3 REASONS TO JOIN US</b></h3>\n <ul>\n  <li> Super fast growing Start-up with an autonomous working culture</li>\n  <li> Work with experienced software engineers in US, Poland and Ukraine</li>\n  <li> Fun place to work with competitively attractive salary and benefits </li>\n </ul>\n <h3 class=\"jobSectionHeader\"><b>SALARY &amp; BENEFITS</b></h3>\n <ul>\n  <li> Community of people who do their jobs with integrity and dedication to service</li>\n  <li> Competitive compensation package with incentives, including stock options</li>\n  <li> Performance review every 6 months</li>\n  <li> Premium Life Insurance package (Health Insurance included)</li>\n  <li> Annual Health check </li>\n  <li>Onsite opportunity including short-term assignments in the U.S</li>\n  <li> Open working space with modern equipment (Macbook, monitors and anything you need!)</li>\n  <li> Flexible working model and unlimited vacation policy </li>\n </ul>\n <h3 class=\"jobSectionHeader\"><b>OUR PROCESS</b></h3>\n <ul>\n  <li> Cultural screening</li>\n  <li> Short tech task<i> (Please ensure your Github or other types of portfolio showing your most up-to-date code samples. If the materials are not sufficient, we would require this step for better judgement) </i></li>\n  <li>Hiring manager interview</li>\n  <li> Technical interviews</li>\n  <li> Conversation with CEO/CTO, Quinten \"Q\" Shay</li>\n </ul>\n <div>\n   Picket is venture funded, and founded by a team of entrepreneurs and executives from top technology, real estate, and investment companies (Amazon, Google, Microsoft, etc.). Our team has been increasing from 11 to more than 100 employees within the last 18 months and will definitely continue to grow in the future. Let become a Picketeer and join the journey with us!!!\n  <br> \n </div>\n <div></div>\n <br> \n <div>\n  We do not accept solicitations from third-party recruiters for any positions. A background check is required for this position. Picket is an equal-opportunity employer that celebrates diversity and we welcome applicants from all backgrounds.\n </div>\n <div></div>\n <div>\n  <br> At Picket Homes, we are building something new and different - come build with us.\n </div>\n <div></div>\n <div>\n  <br> #LI-Hybrid\n </div>\n</div>"}
]